src/DataProcessors/am_ПомошникЗакупокНовый/am_ПомошникЗакупокНовый.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>am_ПомошникЗакупокНовый</name>
</mdclass:DataProcessor>

src/AccumulationRegisters/Запасы/Запасы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="91112615-1767-47d9-8493-56f4f6155586">
  <name>Запасы</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <resources extendedConfigurationObject="f72e33d3-324f-4f94-a330-a919e0f98615">
    <name>Количество</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="c7062576-207c-44e8-825d-004e5809e5ae">
    <name>Сумма</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="7f9237f1-027e-4670-9ba7-4167ac725dfb">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="74a630ed-a0e3-4e20-874c-32e15365b300">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="b2cd2e24-61a2-48a7-b133-f28bf6497017">
    <name>СчетУчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="3400ef97-0dfb-4ed4-8038-011261a9ace3">
    <name>СтруктурнаяЕдиница</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="2c140d47-2059-4f8f-a235-e3e91129b658">
    <name>ЗаказПокупателя</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="935b3699-2154-4396-beb4-9d3089189c2c">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:AccumulationRegister>

src/InformationRegisters/УправлениеЗапасами/УправлениеЗапасами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="b50a9db6-2011-47a6-95a3-9731d57774e6">
  <name>УправлениеЗапасами</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="19770c7f-7089-4ad4-8fbc-27bc115dae14">
    <name>МинимальныйУровеньЗапаса</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="60a6c76e-3789-4de2-b456-7c72bd3a544e">
    <name>МаксимальныйУровеньЗапаса</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="0f550a13-c0ff-477e-b959-c127927273ea">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

src/AccumulationRegisters/ЗаказыПоставщикам/ЗаказыПоставщикам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="afd50769-dbc5-49f4-afda-ed7b0aa63e1d">
  <name>ЗаказыПоставщикам</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <resources extendedConfigurationObject="8513e7df-0b74-4d58-a48c-05b111fded15">
    <name>Количество</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="f48b1504-4344-4f68-ae5e-4047600d68ce">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="97578a66-7055-47ce-9765-f07b8ef18280">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="7b1188c1-5a03-45a5-aa71-8f18b534afca">
    <name>ЗаказПоставщику</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="e1fc91ba-749b-428c-bc1b-bcc14e935e98">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:AccumulationRegister>

src/Enums/ВидыОперацийЗаказПоставщику/ВидыОперацийЗаказПоставщику.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="195594a6-bc92-4279-99a7-226a9e295650">
  <name>ВидыОперацийЗаказПоставщику</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="9268666f-650c-4011-b6f7-e0c79daf9b7a">
    <name>ЗаказНаЗакупку</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

src/DataProcessors/am_ПомошникЗакупокНовый/Forms/Форма/Module.bsl
&НаСервере
Процедура КомандаЗаполнитьНаСервере()
	
	zac_ОбщийМодульСервер.ЗапуститьАссистентаПоЗакупу();	
	
	
	
	//ТЗ = Новый ТаблицаЗначений;
	//ТЗ.Колонки.Добавить("Номенклатура");
	//ТЗ.Колонки.Добавить("Количество");
	//
	//Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	ОтчетОРозничныхПродажахЗапасы.Номенклатура КАК Номенклатура
	//               |ИЗ
	//               |	Документ.ОтчетОРозничныхПродажах.Запасы КАК ОтчетОРозничныхПродажахЗапасы
	//               |ГДЕ
	//               |	НЕ ОтчетОРозничныхПродажахЗапасы.Ссылка.zac_Processed_auto
	//               |	И ОтчетОРозничныхПродажахЗапасы.Ссылка.Проведен
	//               |
	//               |СГРУППИРОВАТЬ ПО
	//               |	ОтчетОРозничныхПродажахЗапасы.Номенклатура";
	//Результат = Запрос.Выполнить();
	//Выборка = Результат.Выбрать();
	//
	//Пока Выборка.Следующий() Цикл
	//	
	//	Остатки = 0;
	//	МинУрЗапаса = 0;
	//	МакУрЗапаса = 0;
	//	ВПути = 0;
	//	
	//	Рез = ПолучитьМинИМахОстаток(Выборка.Номенклатура);
	//	
	//	Остатки 	= ПолучитьОстатки(Выборка.Номенклатура, ТекущаяДата());
	//	МинУрЗапаса = Рез[0].МинЗначение;
	//	МакУрЗапаса = Рез[0].МахЗначение;
	//	ВПути		= ПолучитьОстаткиВПути(Выборка.Номенклатура, ТекущаяДата());	
	//	
	//	Если Остатки + ВПути > МакУрЗапаса Тогда
	//		Продолжить;
	//	КонецЕсли;
	//	
	//	Заказать = МакУрЗапаса - ВПути - Остатки - ?(Остатки <= МинУрЗапаса, МинУрЗапаса, 0);
	//	
	//	Если Заказать > 0 Тогда
	//		
	//		НоваяСтрока = ТЗ.Добавить();
	//		НоваяСтрока.Номенклатура 	= Выборка.Номенклатура;
	//		НоваяСтрока.Количество 		= Заказать;
	//		
	//	КонецЕсли;
	//	
	//КонецЦикла;
	//
	////Этап 2

	//СтруктураНовогоДокумента = ПодготовитьСтруктуруНовогоЗаказа();
	//
	//Для Каждого Строка Из ТЗ Цикл
	//	
	//	//Найдём у кого покупали
	//	Контрагент = УКогоКупили(Строка.Номенклатура);
	//	Цена = ПочёмКупили(Строка.Номенклатура);
	//	
	//	//НайдёмЗаказ
	//	РезЗапроса = НайдёмЗаказ(Контрагент);
	//	
	//	Если НЕ РезЗапроса = Неопределено Тогда
	//		
	//		Нашли = Ложь;
	//		ЗаказПостащику = РезЗапроса.ПолучитьОбъект();
	//		
	//		Для Каждого СтрокаЗаказа Из ЗаказПостащику.Запасы Цикл
	//			Если СтрокаЗаказа.Номенклатура = Строка.Номенклатура Тогда 	
	//				СтрокаЗаказа.Количество = Строка.Количество;
	//				Нашли = Истина;
	//			КонецЕсли;
	//		КонецЦикла;
	//		
	//		Если НЕ Нашли Тогда
	//			
	//			НоваяСтрока = ЗаказПостащику.Запасы.Добавить();
	//			НоваяСтрока.Номенклатура 		= Строка.Номенклатура;
	//			НоваяСтрока.Количество 			= Строка.Количество;
	//			НоваяСтрока.Цена 				= Цена;
	//			НоваяСтрока.Сумма 				= Цена * Строка.Количество;
	//			НоваяСтрока.ДатаПоступления 	= ТекущаяДата();
	//			НоваяСтрока.ЕдиницаИзмерения 	= Строка.Номенклатура.ЕдиницаИзмерения;
	//			НоваяСтрока.СтавкаНДС 			= СтруктураНовогоДокумента.СтавкаНДСПоУмолчанию;
	//			СтавкаНДС = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеСтавкиНДС(НоваяСтрока.СтавкаНДС);
	//			НоваяСтрока.СуммаНДС 			= ?(ЗаказПостащику.СуммаВключаетНДС, НоваяСтрока.Сумма - (НоваяСтрока.Сумма) / ((СтавкаНДС + 100) / 100), НоваяСтрока.Сумма * СтавкаНДС / 100);
	//			НоваяСтрока.Всего 				= НоваяСтрока.Сумма + ?(ЗаказПостащику.СуммаВключаетНДС, 0, НоваяСтрока.СуммаНДС);
	//			
	//			
	//		КонецЕсли;
	//		
	//		ЗаказПостащику.СуммаДокумента 	= ЗаказПостащику.Запасы.Итог("Всего");
	//		ЗаказПостащику.Записать(РежимЗаписиДокумента.Проведение);
	//		
	//	Иначе //Создадим новый заказ
	//		
	//		ЗаказПостащику = Документы.ЗаказПоставщику.СоздатьДокумент();
	//		
	//		ЗаполнитьЗначенияСвойств(ЗаказПостащику, СтруктураНовогоДокумента);
	//		
	//		ЗаказПостащику.Дата 			= ТекущаяДата();
	//		ЗаказПостащику.Контрагент 		= Контрагент;
	//		ЗаказПостащику.Договор 			= Справочники.ДоговорыКонтрагентов.ДоговорПоУмолчанию(Контрагент);
	//		
	//		НоваяСтрока = ЗаказПостащику.Запасы.Добавить();
	//		НоваяСтрока.Номенклатура 		= Строка.Номенклатура;
	//		НоваяСтрока.Количество 			= Строка.Количество;
	//		НоваяСтрока.Цена 				= Цена;
	//		НоваяСтрока.Сумма 				= Цена * Строка.Количество;
	//		НоваяСтрока.ДатаПоступления 	= ТекущаяДата();
	//		НоваяСтрока.ЕдиницаИзмерения 	= Строка.Номенклатура.ЕдиницаИзмерения;
	//		НоваяСтрока.СтавкаНДС 			= СтруктураНовогоДокумента.СтавкаНДСПоУмолчанию;
	//		СтавкаНДС = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеСтавкиНДС(НоваяСтрока.СтавкаНДС);
	//		НоваяСтрока.СуммаНДС 			= ?(ЗаказПостащику.СуммаВключаетНДС, НоваяСтрока.Сумма - (НоваяСтрока.Сумма) / ((СтавкаНДС + 100) / 100), НоваяСтрока.Сумма * СтавкаНДС / 100);
	//		НоваяСтрока.Всего 				= НоваяСтрока.Сумма + ?(ЗаказПостащику.СуммаВключаетНДС, 0, НоваяСтрока.СуммаНДС);
	//		
	//		ЗаказПостащику.СуммаДокумента 	= ЗаказПостащику.Запасы.Итог("Всего");
	//		ЗаказПостащику.Записать(РежимЗаписиДокумента.Проведение);
	//		
	//	КонецЕсли;
	//	
	//КонецЦикла;
	//
	//
	//Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ
	//|	ОтчетОРозничныхПродажах.Ссылка КАК Ссылка
	//|ИЗ
	//|	Документ.ОтчетОРозничныхПродажах КАК ОтчетОРозничныхПродажах
	//|ГДЕ
	//|	НЕ ОтчетОРозничныхПродажах.Ссылка.zac_Processed_auto
	//|	И ОтчетОРозничныхПродажах.Проведен";
	//Результат = Запрос.Выполнить();
	//Выборка = Результат.Выбрать();
	//
	//Пока Выборка.Следующий() Цикл
	//	
	//	Док = Выборка.Ссылка.ПолучитьОбъект();
	//	Док.zac_Processed_auto = Истина;
	//	Док.Записать(РежимЗаписиДокумента.Запись);
	//	
	//КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьОстатки(Номенклатура, Дата)
	
	РезЗапроса = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЗапасыОстатки.КоличествоОстаток КАК КоличествоОстаток
	|ИЗ
	|	РегистрНакопления.Запасы.Остатки(&Дата, Номенклатура = &Номенклатура) КАК ЗапасыОстатки";
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		РезЗапроса = Выборка.КоличествоОстаток;	
	КонецЕсли;
	
	Возврат РезЗапроса
	
КонецФункции

&НаСервере
Функция ПолучитьМинИМахОстаток(Номенклатура)
	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("МинЗначение");
	ТЗ.Колонки.Добавить("МахЗначение");
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	УправлениеЗапасами.МинимальныйУровеньЗапаса КАК МинимальныйУровеньЗапаса,
	|	УправлениеЗапасами.МаксимальныйУровеньЗапаса КАК МаксимальныйУровеньЗапаса
	|ИЗ
	|	РегистрСведений.УправлениеЗапасами КАК УправлениеЗапасами
	|ГДЕ
	|	УправлениеЗапасами.Номенклатура = &Номенклатура";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	НоваяСтрока = ТЗ.Добавить();
	
	Если Выборка.Следующий() Тогда
		
		НоваяСтрока.МинЗначение	= Выборка.МинимальныйУровеньЗапаса;
		НоваяСтрока.МахЗначение	= Выборка.МаксимальныйУровеньЗапаса;

	Иначе
		
		НоваяСтрока.МинЗначение	= 0;
		НоваяСтрока.МахЗначение	= 0;
		
	КонецЕсли;	
	
	Возврат ТЗ
	
КонецФункции

&НаСервере
Функция ПолучитьОстаткиВПути(Номенклатура, Дата)
	
	РезЗапроса = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЗаказыПоставщикамОстатки.КоличествоОстаток КАК КоличествоОстаток
	|ИЗ
	|	РегистрНакопления.ЗаказыПоставщикам.Остатки(&Дата, Номенклатура = &Номенклатура) КАК ЗаказыПоставщикамОстатки";
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		РезЗапроса = Выборка.КоличествоОстаток;	
	КонецЕсли;	
	
	Возврат РезЗапроса
	
КонецФункции

&НаСервере
Функция УКогоКупили(Номенклатура)
	
	РезЗапроса = Справочники.Контрагенты.НайтиПоНаименованию("<Без контрагента>");  //создать если ненайден
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ПриходнаяНакладнаяЗапасы.Ссылка.Контрагент КАК Контрагент,
	               |	ПриходнаяНакладнаяЗапасы.Ссылка.Дата КАК Дата
	               |ИЗ
	               |	Документ.ПриходнаяНакладная.Запасы КАК ПриходнаяНакладнаяЗапасы
	               |ГДЕ
	               |	ПриходнаяНакладнаяЗапасы.Номенклатура = &Номенклатура
	               |	И НЕ ПриходнаяНакладнаяЗапасы.Ссылка.ПометкаУдаления
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Дата УБЫВ";
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		РезЗапроса = Выборка.Контрагент;	
	КонецЕсли;	
	
	Возврат РезЗапроса
	
КонецФункции

&НаСервере
Функция ПочёмКупили(Номенклатура)
	
	РезЗапроса = 1;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПриходнаяНакладнаяЗапасы.Ссылка.Контрагент КАК Контрагент,
	|	ПриходнаяНакладнаяЗапасы.Ссылка.Дата КАК Дата,
	|	ПриходнаяНакладнаяЗапасы.Цена КАК Цена
	|ИЗ
	|	Документ.ПриходнаяНакладная.Запасы КАК ПриходнаяНакладнаяЗапасы
	|ГДЕ
	|	ПриходнаяНакладнаяЗапасы.Ссылка.Проведен
	|	И ПриходнаяНакладнаяЗапасы.Номенклатура = &Номенклатура
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ";
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		РезЗапроса = Выборка.Цена;	
	КонецЕсли;	
	
	Возврат РезЗапроса
	
КонецФункции

&НаСервере
Функция НайдёмЗаказ(Контрагент)
	
	РезЗапроса = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ЗаказПоставщикуЗапасы.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.ЗаказПоставщику.Запасы КАК ЗаказПоставщикуЗапасы
	               |ГДЕ
	               |	ЗаказПоставщикуЗапасы.Ссылка.Контрагент = &Контрагент
	               |	И ЗаказПоставщикуЗапасы.Ссылка.Проведен
	               |	И ЗаказПоставщикуЗапасы.Ссылка.zac_Processed_auto";
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		РезЗапроса = Выборка.Ссылка;	
	КонецЕсли;	
	
	Возврат РезЗапроса
	
КонецФункции


&НаСервере
Функция ПодготовитьСтруктуруНовогоЗаказа()
	
	//ЗаказныеПозиции = Объект.НоменклатураКЗаказу.Выгрузить();
	//Для Индекс = -ЗаказныеПозиции.Количество() + 1 По 0 Цикл
	//	Если НЕ ЗаказныеПозиции[-Индекс].Выбор Тогда
	//		ЗаказныеПозиции.Удалить(-Индекс);
	//	КонецЕсли;
	//КонецЦикла;
	
	СтруктураНовогоДокумента = Новый Структура;
	СтруктураНовогоДокумента.Вставить("Организация", Справочники.Организации.ОрганизацияПоУмолчанию());
	СтруктураНовогоДокумента.Вставить("СтруктурнаяЕдиницаРезерв", Справочники.СтруктурныеЕдиницы.ОсновнойСклад);
	СтруктураНовогоДокумента.Вставить("СтруктурнаяЕдиница", Справочники.СтруктурныеЕдиницы.ОсновноеПодразделение);
	СтруктураНовогоДокумента.Вставить("ВалютаДокумента", Константы.ВалютаУчета.Получить());
	СтруктураНовогоДокумента.Вставить("СостояниеЗаказа", Справочники.СостоянияЗаказовПоставщикам.НайтиПоНаименованию("Новый")); //необходимо создать лемент при его отсутствии   
	СтруктураНовогоДокумента.Вставить("Автор", ПараметрыСеанса.ТекущийПользователь);
	СтруктураНовогоДокумента.Вставить("БанковскийСчет", Справочники.БанковскиеСчета.БанковскийСчетСубъекта(СтруктураНовогоДокумента.Организация));
	СтруктураНовогоДокумента.Вставить("ВидОперации", Перечисления.ВидыОперацийЗаказПоставщику.ЗаказНаЗакупку);
	СтруктураНовогоДокумента.Вставить("ДатаПоступления", ТекущаяДата() + 86400*7);
	СтруктураНовогоДокумента.Вставить("Касса", Справочники.Кассы.ПолучитьКассуПоУмолчанию(СтруктураНовогоДокумента.Организация));
	СтруктураНовогоДокумента.Вставить("Комментарий", "Документ создал ассистент закупок");
	СтруктураНовогоДокумента.Вставить("Кратность", 1);
	СтруктураНовогоДокумента.Вставить("Курс", 1);
	СтруктураНовогоДокумента.Вставить("НалогообложениеНДС", УправлениеНебольшойФирмойСервер.НалогообложениеНДС(СтруктураНовогоДокумента.Организация,, ТекущаяДата()));
	СтруктураНовогоДокумента.Вставить("НДСВключатьВСтоимость", Истина);
	//СтруктураНовогоДокумента.Вставить("Ответственный", Справочники.Пользователи.);
	СтруктураНовогоДокумента.Вставить("zac_Processed_auto", Истина);
	СтруктураНовогоДокумента.Вставить("ПоложениеДатыПоступления", Перечисления.ПоложениеРеквизитаНаФорме.ВШапке);
	СтруктураНовогоДокумента.Вставить("СуммаВключаетНДС", Истина);
	СтруктураНовогоДокумента.Вставить("ХозяйственнаяОперация", Справочники.ХозяйственныеОперации.ЗаказНаЗакупку);
	
	Если СтруктураНовогоДокумента.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС Тогда
		СтруктураНовогоДокумента.Вставить("СтавкаНДСПоУмолчанию", Справочники.СтавкиНДС.НайтиПоНаименованию("20%", Истина));
	Иначе
		СтруктураНовогоДокумента.Вставить("СтавкаНДСПоУмолчанию", УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДСБезНДС());
	КонецЕсли;

	Возврат СтруктураНовогоДокумента
	
КонецФункции


&НаКлиенте
Процедура КомандаЗаполнить(Команда)
	КомандаЗаполнитьНаСервере();
КонецПроцедуры
